#1 print()을 이용해서 다음 내용이 출력되도록 프로그램을 작성해보세요
print("########## 1 ########### \n")

print('*   *   **   ****   ****   *   *  /////   ')
print('*   *  *  *  *   *  *   *  *   *  | o o | ')
print('***** *    * ****   ****    * *  (|  ^  |)')
print('*   * ****** *   *  *   *    *    | [_] | ')
print('*   * *    * *    * *    *   *     -----  ')


print('            +---+       ')
print('            |   |       ')
print('        +---+---+       ')
print('        |   |   |       ')
print('    +---+---+---+        /\\_/\\     -----')
print("    |   |   |   |       ( ' ' )  / Hello \\")
print('+---+---+---+---+       (  -  ) <  Junior |')
print('|   |   |   |   |        | | |   \\ Coder!/')
print('+---+---+---+---+       (__|__)    -----')

#2 이름 , 나이 , 몸무게
print("########## 2 ########### \n")

name = "여기용"
weight = 75
age = 32
print('이름 {0}, 몸무게 {1}, 나이 {2}'.format(name,weight,age))

#3 수학식을 파이썬 표현식으로 작성
print("########## 3 ########### \n")

x = 2
y = 3
z = 4
print('3x=',3 * x)
print('3x+y=',3 * x+y)
print('(x+y/7=',(x + y)/7)
print('(3x+y)/(z+2)',(3*x+y)/(z+2))

#4 다음 표현식을 완성
print("########## 4 ########### \n")

x = 4
y = 8
x *= y  # x = x * y
print('x*= :',x)
x -= y  # x = x -y
print('x-=y:',x)

#5 다음 수식을 파이썬으로 작성
print("########## 5 ########### \n")

x = 3
print(x + 7 == 10)


print("########## 6 ########### \n")

print((-32+95) * 12 /3)
print((3*4 -(( -27 + 67)/4))**8)
print(((512+1968-432)/2**4) +128)
print(256 == 2**8)
print(50 + 50 <= 10 * 10)
print(99 != 10**2 -1)

print("########## 7 ########### \n")

x,y,m,n = 2.5,-1.5,18,4

print(x+n*y-(x+n)*y)
print(m/n + m % n)
print(5 * x - n / 5)
print(1-(1-(1-(1-n))))

#8 생활속 문제를 파이썬으로 풀기
print("########## 8 ########### \n")
a = (2.5 * 3) / 27
b = (4 * 2) /30

print(a)
print(b)

#9
print("########## 9 ########### \n")
print('3+4.5*2+27/8 : ',3+4.5*2+27/8)
print('True or False and 3<4 or not(5==7) : ',True or False and 3<4 or not(5==7))
print('True or (3<5 and 6>=2) : ',True or (3<5 and 6>=2))
#print('not True > "A": ',not True > 'A')  #문자에 비교연산자
#print("7 % 4 + 3 - 2 / 6 * 'Z' :",7 % 4 + 3 - 2 / 6 * 'Z') #문자에 산술연산자
#print("'D' + 1 + 'M' %2 / 3 :",'D' + 1 + 'M' %2 / 3) #문자에 비교연산자
print('5.0 / 3 + 3 /3 : ',5.0 / 3 + 3 /3)
print('53 % 21 < 45 /18 : ',53 % 21 < 45 /18)
print('(4<6) or True and False or False and (2>3)" :',(4<6) or True and False or False and (2>3))
print('7 -(3+8*6+3) - (2+5*2) : ',7 -(3+8*6+3) - (2+5*2))

#10 이율율 계산 - 도메인 문제
#지문만으로는 문제를 해결할 수 없음 - 문제에 대한 배경 지식 필요 - 이윤율 공식
print("########## 10 ########### \n")

#이윤율 = 잉여가치액(45)/(불변자본(30)+(가변자본(15)
print("한 해 이윤율 : ",45/(30/+15))

#11 환율에 따른 노트북 구매
#달러 : 780
#유로 : 650
#달러 환율 : 1071, 2018.01.22 현재
#유로 환율 : 1309, 2018.01.22 현재
달러노트북 = 780 * 1071
유로노트북 = 650 * 1309
print("########## 11 ########### \n")

print('달러노트북 %d, 유로노트북 %d' %(달러노트북, 유로노트북))

#12 운동장 너비 계산
#원의 둘레 계산식 : pi * 지름
pi = 3.14
바깥학생거리 = pi * 100
안쪽학생거리 = pi * 90
distance = 바깥학생거리 - 안쪽학생거리
print("########## 12 ########### \n")
print('바깥학생이 %d 미터 더 달렸음' % distance)

#13 표현식 확인하기
print("########## 13 ########### \n")
print("Check out this line")
#print("//hello there " + '9' + 7) #문자와 숫자 간 산술연산
#print('H'+'I'+"is" + 1 + "more example")
#print('H'+6.5+'I'+"is"+1+"more example") #문자와 숫자 간 산술연산
print("Print both of us","Me too")
print("Reverse " + 'I' + 'T')
#print("Nonot Here is" + 1 + "more example")
#print("Here is" + 10*10)
#print("Not x is " + true) # 문자와 블리언
print()
print  #함수의 유형 출력
#print("How about this one" ++ '?' + 'Huh?') #증가연산자

#15 표현식 결과 알아보기
print("########## 15 ########### \n")
print(27/13 + 4)
print(27/13 + 4.0)
print(42.7%3 + 18)
#print((3<4) and 5 /8)
print(23/5 + 23/5.0)
#print(2.0 + 'a')
#print(2 + 'a')
#print('a' + 'b')
#print('a' / 'b')
#print('a' and not 'b')
#print((double)'a'/'b') #float()실수변환 함수

#16 증감연산자가 파이썬에도 있나?
#파이썬에서는 기본적으로 ++, --는 지원X
print("########## 16 ########### \n")

n=3
print(++n) #+(+n), ++n, n--
print(--n)  #-(-n)
n+=1
print(n)
n=3
n-=1
print(n)

#17 사칙연산 프로그램 -input함수 이용
print("########## 17 ########### \n")

첫번째정수 = int(input("첫번째 정수를 입력하세요 : "))
두번째정수 = int(input("두번째 정수를 입력하세요 : "))

합 = 첫번째정수 + 두번째정수
차 = 첫번째정수 - 두번째정수
곱 = 첫번째정수 * 두번째정수
나누기 = 첫번째정수 / 두번째정수

print("%d + %d = %d" %(첫번째정수, 두번째정수,합))
print("%d - %d = %d" %(첫번째정수, 두번째정수,차))
print("%d * %d = %d" %(첫번째정수, 두번째정수,곱))
print("%d / %d = %.1f" %(첫번째정수, 두번째정수,나누기))

